[
    {
      "name": "MasterMind",
      "live": "https://isbrakha.github.io/1st-project-mastermind/",
      "git": "https://github.com/isbrakha/1st-project-mastermind",
      "image": "https://i.imgur.com/yU0PsFN.png",
      "desc": "A web-based adaptation of the classic game Mastermind, built with efficient JavaScript. The app features a clean, intuitive UI and an advanced algorithm for the critical black and white feedback pegs. This algorithm challenges players to decipher the computer-generated code, adding depth and engagement to the gameplay. The implementation of this feature highlights practical skills in game logic and user-focused design, offering a compelling blend of classic puzzle strategy and modern digital interface."
    },
    {
      "name": "DoggyDate",
      "live": "https://doggydating-c428b5defcd3.herokuapp.com/",
      "git": "https://github.com/Brank8/DoggyDate-App",
      "image": "https://i.imgur.com/oVtrzan.png",
      "desc": "A streamlined web application for dog owners to manage profiles, seek breeding partners, or set playdates. Built with Node.js, Express, and MongoDB, it offers secure Google OAuth sign-in and Cloudinary-powered image uploads. The app includes a smart matching algorithm for user interaction, illustrating my proficiency with complex backend processes and user-focused solutions."
    },
    {
      "name": "Trivial Trivia",
      "live": "https://dreamy-sundae-fbc7da.netlify.app/",
      "git": "https://github.com/isbrakha/trivial-trivia",
      "image": "https://i.imgur.com/LKZOC8Z.png",
      "desc": "An interactive trivia application, leveraging React for a dynamic user experience, allows players to test their knowledge across various categories and difficulty levels. The app offers a sleek, user-friendly interface and a range of customizable settings, providing a personalized trivia challenge. Key features include the selection of game types and real-time feedback, enhancing engagement and learning opportunities. This project showcases a harmonious integration of front-end reactiveness with robust gameplay logic."
    }
  ]

